// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
// Решение:
int PrintNaturNumbers(int N) {
    if (N == 0) return 0;
    Console.Write($"{N} ");
    return PrintNaturNumbers(N-1);
}

PrintNaturNumbers(15);

//_______________________________________________________________________________________________________________________________________________
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
// Решение:

int SumNumbers(int M, int N) {
    if (N <= M) return M;
    return N + SumNumbers(M, N-1);
}

Console.WriteLine($"\nРезультат программы {SumNumbers(50, 15)}");


//_______________________________________________________________________________________________________________________________________________
// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29
// Решение:
int AkkermanA(int m, int n) {
    if (m == 0) return n + 1;
    if (m > 0 & n == 0) return AkkermanA(m-1, 1);
    return AkkermanA(m-1, AkkermanA(m, n-1));

}

Console.WriteLine(AkkermanA(3, 3));

//_______________________________________________________________________________________________________________________________________________
// ______________________________________________________________________________________________________________________________________________

// Домашнее задание Задачи 60, 62 СЕМИНАР 8 
// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
// Массив размером 2 x 2 x 2
// 66(0,0,0) 25(0,1,0)
// 34(1,0,0) 41(1,1,0)
// 27(0,0,1) 90(0,1,1)
// 26(1,0,1) 55(1,1,1)
// Решение 
int[,,] RandomArr3D(int x, int y, int z) {
    int[,,] result = new int[x, y, z];
    for (int i=0; i < result.GetLength(0); i++) {
        for (int j=0; j < result.GetLength(1); j++) {
            for (int k=0; k < result.GetLength(2); k++) {
                result[i, j, k] = new Random().Next(10, 99) + new Random().Next(1, 10);
            }
        }
    }
    return result;
}
int[,,] my_3darr = RandomArr3D(2, 3, 2);
for (int i=0; i < my_3darr.GetLength(0); i++) {
    for (int j=0; j < my_3darr.GetLength(1); j++) {
        for (int k=0; k < my_3darr.GetLength(2); k++) {
            Console.WriteLine($"{my_3darr[i, j, k]}({i},{j},{k})");
        }
    }
}

//_______________________________________________________________________________________________________________________________________________
// Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
// Например, на выходе получается вот такой массив:
// 01 02 03 04
// 12 13 14 05
// 11 16 15 06
// 10 09 08 07
void PrintArr(int[,] my_arr){
    for (int i = 0; i < my_arr.GetLength(0); i++) {
        for (int j = 0; j < my_arr.GetLength(1); j++) { 
            Console.Write(my_arr[i, j] + " ");
        }
        Console.WriteLine();
    }
}

int [,] sqArr = new int[4,4];
int temp_var = 1;
int x = 0;
int y = 0;

while (temp_var <= sqArr.GetLength(0) * sqArr.GetLength(1))
{
  sqArr[x, y] = temp_var;
  temp_var++;
  if (x <= y + 1 && x + y < sqArr.GetLength(1) - 1)
    y++;
  else if (x < y && x + y >= sqArr.GetLength(0) - 1)
    x++;
  else if (x >= y && x + y > sqArr.GetLength(1) - 1)
    y--;
  else
    x--;
}

PrintArr(sqArr);

